Tekla Open API Reference for Tekla Structures 2025
GraphicPolyLine.LineType Enumeration
 The appearance of the line. For instance solid, dashed or dotted.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LineType
Public Enumeration LineType
Members
Member name | Value | Description
Solid | 1 |  The solid line type.
Dashed1 | 2 |  The first dashed line type.
Dashed2 | 3 |  The second dashed line type.
DashedAndDotted | 4 |  The dashed and dotted line type.
Dotted | 5 |  The dotted line type.
See Also
Reference
Tekla.Structures.Model.UI Namespace